abundant丰富的plentiful丰富的
accelerate加速increase增加
accessible可达到的reachable可达到的
accordingly因此forthatreason因此
accountfor说明explain说明
accumulate积聚collect收集
acute急性的intense剧烈的
adhere粘附stick粘附
adjunct辅助addition附加
adorn装饰decorate装饰
adverse相反的negative负面的
advocate提倡者proponent支持者
aesthetical审美的artistic艺术的
astound令人极为惊讶surprise令人惊讶
attachment(to)喜爱preference(for)喜爱
attain获得achieve获得
attendant伴随的accompanying伴随的
attire衣物clothing衣物
attribute特征characteristic特点
aviation航空navigation航空

barren贫瘠的infertile贫瘠的
bias偏见prejudice偏见
bizarre奇异的odd奇怪的
boost促进raise提高
bound限制limit限制
break(with)与…相分离departure(from)与…相分离
bringabout导致cause导致

calculate计划determine决定
carry支撑support支撑
castoff丢弃getridoff抛弃
cease终止stop停止
celestial天上的astronomical天文的
chance偶然的unplanned未计划的
characterized具有特色的distinguished杰出的
classify分类categorize分类
coarse粗糙rough粗糙
cohesion凝聚unity结合，统一
coin创造，杜撰create创造
collectively共同地together一起
comparably类似similarly同样地
compile收集puttogether收集
compose创作create创作，创造
comprise由….组成consistof由…..组成
conceal隐藏hide隐藏
concentrate集中cluster集中
conclusive最后的，结论性的definitive最后的，确定性的
concomitantwith与…..相一致inconjunctionwith与…..相一致
condone宽恕mercy宽恕
confined被限制的limited限制的
conflict冲突opposition相反
conjectural推测的basedonguessing基于猜测的
consciously有意识地onpurpose有目的地
conserve保存retain保存中华考试网
considerable(数量、程度)巨大的great巨大的
considerable巨大的much许多的
considerable大量的substantial大量的，坚实的
consort合伙人，伴侣associate合伙人，伙伴
conspicuous明显的noticeable明显的
constituent组成部分component成分
constitute构成makeup构成
consult商量counsel商量
consumption消费eating吃
contemporary当代的existing现存的
counteract抵消negate取消，否定
counterpart副本version版本
crucial重要的，关键的essential重要的，基本的
cumbersome麻烦的burdensome麻烦的
customary习俗的usual一般的

dampen使潮湿moisten使潮湿
daring大胆的bold大胆的
deft灵巧的skilled熟练的
deliberate深思熟虑的careful小心的
demand要求order命令
demonstrate证明show显示
dense密集的thick周密的
depress降低lower降低
depressed沮丧的saddened悲伤的，沮丧的
derive取得，获得obtain获得
detect发现discoverthepresenceof发现…..的存在
detectable可察觉的，可测出的measurable可测量的
detectable可察觉的，可测出的sizable巨大的
devastate损坏ruin毁灭
devote投身dedicate致力
dictate规定determine确定
diffuse扩散travel传播
dirt土壤soil土壤
disaster灾祸catastrophe大灾祸
discreet慎重的careful小心的
discrete离散的separate分离的
dispute争论argument争论
disseminate传播spread/impart/inform散布/传播/传播
distinct截然不同的different不同的
distinct明显的obvious明显的
distinct分别的，截然不同的separate分离的
distinction区别difference差别
distinguished不同的differentiated不同的，有区别的
divergence分歧difference不同
dogma教条belief/doctrine信仰/教条
domain范围，领域field土地，领域
dominate占优势beprevalentin占优势
dramatic引人注目的striking引人注目的
drastic猛烈的radical根本的
drastic激烈的severe猛烈的
draw吸引attract吸引
durable耐久的lasting持久的
durable耐久的endurable持久的
dwelling住宅house房子

eagerlyanticipate热切地期望lookforwardto盼望
elaborate详尽的，精巧的detailed详细的，精细的
embed植入encase包裹
embrace(欣然)接受welcome欢迎
embracer接收者recipient接收者，收件人
emerge出现appear出现
emit发射giveoff发射
employ雇用hire雇用
enable使能够allow准许
enable使能够help帮助
enact制定法律，扮演角色perform扮演角色
end目的goal目的
entire全部的whole全部的
entity实体object物体
entomb埋葬trap使陷于….之中
eradicate根除eliminate清除
essential基本的fundamental基本的
evidence表明indicate指出
exalted高贵的superior出众的
exceed超越surpass超过
execute(按计划或设计)做成，制成create创造
exert施加apply施行
exorbitant昂贵的expensive昂贵的
expedient权宜之计makeshift权宜之计
exponentialleaps几何级数般的跳跃rapidincreases快速增加
expose揭露uncover揭露
exposeto暴露于subjectto使经受，使遭受
extend延长increase增加，扩大
extend延伸stretch伸展中华考试网
extol赞美praise赞扬
extract提取remove清除

faction帮派side一方
fade(form)淡出disappear(form)消失
fashion制作create创造
fatal致命的deadly致命的
feed填入put放入
fine细小的minute微小的
firstrank顶级的highestquality最高档次的
fixture固定装备commonplaceobject常规物体
flatter奉承compliment赞美
forage喂草料feed喂食
forward-looking有远见的progressive进步的
frame给…设框pose使摆放姿势
fundamental基本的basic基本的
fuse融合combine联合

jolt使震惊的shock使震惊的

lament令人对….感到遗憾complainabout抱怨
lure引诱attract吸引

magnify扩大increase提高
magnify扩大intensify加强
magnitude量值，大小extent范围
maintain维持preserve/keep保持/保持
major主要的principal主要的
maneuver策略，花招trick诡计
margin边缘edge边缘
marked明显的pronounced明显的
meticulous过分注意细节的careful小心的
milestone里程碑significantdevelopment重大发展的
minuscule微小的tiny微小的
minute微小的tiny微小的
modify改变change改变
monopolize垄断dominate支配
moreover进一步说furthermore进一步说
mundane世俗的ordinary平常的
myriadof无数的many许多的

nevertheless然而however然而
novel新颖的innovative创新的
noxious有害的harmful有害的

obtain得到acquire获得
obtain获得get得到
outbreak爆发beginning开始
outline概要summarization概述
outstanding出类拔萃的excellent很好的

peak顶峰maximum最大值
peculiar独特的distinctive独特的
penetrate穿过gothrough穿过
persist坚持continue持续
pertinent相关的relevant相关的
phenomenon现象event事件
pickup沿着follow沿着
picture想象，描写imagine/describe想象/描写
pit深坑hole洞
ponder沉思meditate沉思www.examw.com
ponderous笨重的heavy沉重的
pore孔hole洞
position位置location位置
potential潜在的possible可能的
prefer倾向，喜欢favor喜欢
preoccupation全神贯注involvement全神贯注
presideover掌管manage掌管
prevailing主要的mostfrequent最经常的
prevent阻止avoid避免
primary基础的fundamental基本的，基础的
principal主要的main主要的
priorto在…之前preceding前面的
prominent卓越的distinguished杰出的
prominent卓越的prestigious著名的
property特点characteristic特点
proponent支持者supporter支持者
prospect前景possibility可能性
protrude突出project突出
puncture刺破pierce刺破

rapid快速的swift迅速的
rare稀罕的infrequent不经常的
rather相反instead相反
readily容易地easily容易地
realization认识到awareness认识到
reap收获gain获得
reckless不负责任的irresponsible不负责任的
refreshing给人新鲜感的unusual不同寻常的
relate与…有关connect与…有关
reliance依靠dependence依靠
remarkable非凡的extraordinary非凡的
restricted受限制的limited受限制的
revise修改change改变
rich丰富的abundant丰富的
robust强壮的strong强壮的
rollback把…压到标准水平reduce降低，减少
rotate旋转alternate交替
rotate旋转turn旋转
roughly大约approximately大概
rudimentary初步的，尚未发展完备undeveloped尚未发展完备的
rupture爆裂burst爆裂

sanitation卫生health卫生
scale攀登climb攀登
scope范围range范围外语学习网
secure弄到，获得acquire获得
secure安全的safe安全的
set设置establish建立
settle定居locate坐落
shield保护protect保护
shyawayfrom躲避avoid躲避
simultaneous同时的synchronous同时的
since因为because因为
site地点location位置
skepticism怀疑doubt怀疑
skilled熟练的expert熟练的
skyrocket快速上升的increaserapidly迅速增加
smother窒息eliminate清除
snap断裂break断裂
sole唯一的only唯一的
solemn严肃的serious严肃的
some大约approximately大概
sortout区分separate分离
spark引起，开始bring(about)/usher(in)引起/开始
spawn引起，大量生产create创造
speculate推测hypothesize假设
spot发现identify确定，鉴别
staggering令人惊愕的overwhelming压倒性的
staple主要部分basicelement基本组成部分
stationary静止的fixed固定的
stimulate刺激encourage鼓励www.Examw.com
story故事tale故事
strategy诡计scam/trick诡计/诡计
strength力量的源泉basis基础
stress强调emphasize强调
stringent严格的strict严格的
struggle挣扎competition竞争
subjectto易受….的susceptibleto易受….的
subsidize资助finance资助
substantiate证实verify证实
subtle精巧微妙的slight细微的
succinct简短的concise/terse简明的/简短的
sufficient充足的adequate充足的
sumptuous诸多的luxurious诸多的
supplement补充extension扩展，延伸
support支持hold/upload支撑/支持
supposed假定的seeming表面上的
supremacy至高无上的dominance优势
supreme至高无上的mostoutstanding最出类拔萃的
surge汹涌进行accelerate加速发展
suspend悬挂hang悬挂
symmetrical对称的proportionallybalanced比例平衡的

tangle纠缠twist/jumble缠绕/使混乱
tempting吸引人的attractive吸引人的
thankful感谢grateful感激
trace痕迹imprint印记
trend倾向tendency趋向

unadorned未装饰的disorganized混乱的
undergo经历experience经历
uniform统一integrate整合
unique独一无二的particular独特的
unravel弄清discover发现
usherin开始begin开始

vary改变differ与…不同
vast宽广的，巨大的large巨大的
vibrate震动convulse震动
vigilant警惕的alert警惕的
virtually实质上(几乎)actually/practically/almost实际上(几乎)

witness目击observe观察

yield产生provide提供
